In [1]:
import pandas as pd
summer = pd.read_csv('summer.csv')
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

## format of iloc : summer.iloc(row,column)

In [5]:
#get athlete name from first row
summer.iloc[0,4]

'HAJOS, Alfred'

In [7]:
summer.iloc[0,0:3] #year,city,sport for first row

Year         1896
City       Athens
Sport    Aquatics
Name: 0, dtype: object

In [8]:
summer.iloc[0,[2,4,6]]

Sport           Aquatics
Athlete    HAJOS, Alfred
Gender               Men
Name: 0, dtype: object

In [10]:
summer.iloc[10:15,[2,4,6,8]]

        Sport            Athlete Gender   Medal
10   Aquatics  PEPANOS, Antonios    Men  Silver
11  Athletics      LANE, Francis    Men  Bronze
12  Athletics   SZOKOLYI, Alajos    Men  Bronze
13  Athletics      BURKE, Thomas    Men    Gold
14  Athletics     HOFMANN, Fritz    Men  Silver

In [17]:
summer.iloc[:,4].equals(summer.Athlete)

True

In [18]:
#better way to get an entire column
summer.Athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object